### 1) For our data cleaning exercises, we will return one last time to our ACS data here. Download and import the 10percent ACS sample.

In [1]:
import pandas as pd
df = pd.read_stata('/Users/laroehr/Downloads/US_ACS_2017_10pct_sample (2).dta')

### 2) For our exercises today, weâ€™ll focus on age, gender, sex, educ, and inctot. Subset your data to those variables, and quickly look at a sample of 10 rows.

In [2]:
df_subset = df[["age", "sex", "educ", "inctot"]]
df_subset.sample(10)

       age     sex                       educ   inctot
2244    22  female         4 years of college    22000
160347  91  female         2 years of college    15900
282308  22  female         4 years of college      500
224871  46  female         2 years of college        0
129822  32  female         2 years of college    18000
310044   6  female  nursery school to grade 4  9999999
255916  22  female          1 year of college        0
229582  68    male          1 year of college    54000
225497  81    male                   grade 12    36000
89863   60    male                   grade 11    13200

3) First, replace all the values of inctot that are 9999999 with np.nan.

In [3]:
import numpy as np
df_subset['inctot'].replace(9999999, np.NaN)

0              NaN
1           6000.0
2           6150.0
3          14000.0
4              NaN
            ...
318999     22130.0
319000         NaN
319001      5000.0
319002    240000.0
319003     48000.0
Name: inctot, Length: 319004, dtype: float64

### 4) Calculate the average age of people in our data. What do you get?

In [4]:
df_subset['age'].mean()

TypeError: 'Categorical' does not implement reduction 'mean'

### Response: Does not work because it is a categorical variable.

5) We want to be able to calculate things using age, so we need it to be a numeric type. Check all the values of age to figure out why itâ€™s categorical and not numeric. You should find two problematic categories.

In [10]:
df_subset['age']

0          4
1         17
2         63
3         66
4          1
          ..
318999    33
319000     4
319001    20
319002    47
319003    33
Name: age, Length: 319004, dtype: category
Categories (97, object): ['less than 1 year old' < '1' < '2' < '3' ... '93' < '94' < '95' < '96']

### 6) In order to convert age into a numeric variable, we need to replace those problematic entries with values that pandas can later convert into numbers. Pick appropriate substitutions for the existing values and replace the current values. Hint 1: Categorical variables act like strings, so you might want to use string methods! Hint 2: Remember that characters like parentheses, pluses, asterices, etc. are special in Python strings, and you have to escape them if you want them to be interpreted literally!

In [28]:
df_subset["age"].replace("less than 1 year old", "0")
df_subset["age"].replace("90 (90+ in 1980 and 1990)" , "90")
df_subset["age"]

0          4
1         17
2         63
3         66
4          1
          ..
318999    33
319000     4
319001    20
319002    47
319003    33
Name: age, Length: 319004, dtype: int64

### 7) Now convert age from a categorical to numeric.

In [30]:
pd.to_numeric(df_subset["age"])

0          4
1         17
2         63
3         66
4          1
          ..
318999    33
319000     4
319001    20
319002    47
319003    33
Name: age, Length: 319004, dtype: int64

In [31]:
df_subset["age"].mean()

41.30384885455982

### 8) Letâ€™s now filter out anyone in our data whose age is less than than 18. Note that before made age a numeric variable, we couldnâ€™t do this!

In [34]:
df_filtered = df_subset[df_subset["age"] < 18]
df_filtered

        age     sex                       educ   inctot
0         4  female  nursery school to grade 4  9999999
1        17  female                   grade 11     6000
4         1    male        n/a or no schooling  9999999
7         8  female  nursery school to grade 4  9999999
8        14  female        grade 5, 6, 7, or 8  9999999
...     ...     ...                        ...      ...
318989    0    male        n/a or no schooling  9999999
318991   10    male  nursery school to grade 4  9999999
318996   15  female                    grade 9        0
318997    6  female  nursery school to grade 4  9999999
319000    4  female  nursery school to grade 4  9999999

[65970 rows x 4 columns]

### 9) Create an indicator variable for whether each person has at least a college degree called college_degree.

In [35]:
df_subset["educ"]

0         nursery school to grade 4
1                          grade 11
2                4 years of college
3                          grade 12
4               n/a or no schooling
                    ...
318999           4 years of college
319000    nursery school to grade 4
319001                     grade 12
319002          5+ years of college
319003          5+ years of college
Name: educ, Length: 319004, dtype: category
Categories (11, object): ['n/a or no schooling' < 'nursery school to grade 4' < 'grade 5, 6, 7, or 8' < 'grade 9' ... '1 year of college' < '2 years of college' < '4 years of college' < '5+ years of college']